![](https://i.imgur.com/JsMvGnP.png)


## Exercícios de manipulação de dados - Parte 1

Neste Jupyter notebook você irá resolver uma exercícios utilizando a linguagem Python e a biblioteca Pandas.

Todos os datasets utilizados nos exercícios estão salvos na pasta *datasets*.

Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

In [1]:
import pandas as pd

### Passo 1. Importando os dados

Carregue os dados salvos no arquivo ***datasets/users_dataset.csv***.

Esse arquivo possui um conjunto de dados de trabalhadores com 5 colunas separadas pelo símbolo "|" (pipe) e 943 linhas.

Dica: não se esqueça do argumento *sep* quando importar os dados.

In [2]:
users = pd.read_csv('datasets/users_dataset.csv', sep='|')

### Passo 2. Mostre as 15 primeiras linhas do dataset.

*Dica: use a função head do DataFrame*

In [3]:
users.head(15)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301

### Passo 3. Mostre as 10 últimas linhas

In [4]:
users.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### Passo 4. Qual o número de linhas e colunas do DataFrame?

In [5]:
users.shape

(943, 5)

### Passo 5. Mostre o nome de todas as colunas.

In [6]:
users.columns.values

array(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype=object)

### Passo 6. Qual o tipo de dado de cada columa?

In [7]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [8]:
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Passo 7. Mostre os dados da coluna *occupation*.

In [9]:
users['occupation']

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### Passo 8. Quantas ocupações diferentes existem neste dataset?

In [10]:
users['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [11]:
len(users['occupation'].unique())

21

### Passo 9. Qual a ocupação mais frequente?

In [12]:
users['occupation'].value_counts().head(1)

student    196
Name: occupation, dtype: int64

### Passo 10. Qual a idade média dos usuários?

In [13]:
round(users['age'].mean(),2)

34.05

### Passo 11. Utilize o método describe() para obter diversas informações a respeito do DataFrame.

In [14]:
users.describe().T

         count        mean         std  min    25%    50%    75%    max
user_id  943.0  472.000000  272.364951  1.0  236.5  472.0  707.5  943.0
age      943.0   34.051962   12.192740  7.0   25.0   31.0   43.0   73.0

**Parabéns! Você chegou ao fim!**